Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [4]:
import pandas as pd
series = pd.Series(data = [4,8,15,16,23,42])

In [5]:
series

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [6]:
type(series)

pandas.core.series.Series

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [7]:
data = ['a','b','c','d','e','f','g','h','i','j']
series_new = pd.Series(data)

In [8]:
series_new

0    a
1    b
2    c
3    d
4    e
5    f
6    g
7    h
8    i
9    j
dtype: object

In [10]:
type(series_new)

pandas.core.series.Series

Q3. Create a Pandas DataFrame that contains the following data:

In [11]:
data = {
    'name': ['Alice','Bob','Claire'],
    'age': [25,30,27],
    'gender' : ['Female','Male','Female']}

In [14]:
dataframe = pd.DataFrame(data)

In [15]:
dataframe

     name  age  gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [16]:
type(dataframe)

pandas.core.frame.DataFrame

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Dataframe in pandas is a structured two dimensional data structure that is organised in rows and columns table like format. Here each column is homogeneous. Series is a one directional array like structure. Also series shows you an index of each row whereas dataframe doesn't.

#### Example

In [18]:
dataframe

     name  age  gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [17]:
series_new

0    a
1    b
2    c
3    d
4    e
5    f
6    g
7    h
8    i
9    j
dtype: object

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

1. **`.head()`**
   - **Usage**: View the first few rows of a DataFrame.
   - **Example**: `df.head(5)` shows the first five rows.

2. **`.describe()`**
   - **Usage**: Get a statistical summary of numerical columns.
   - **Example**: `df.describe()` provides statistics like mean, standard deviation, min, and max.

3. **`.groupby()`**
   - **Usage**: Group data by specific columns for aggregation.
   - **Example**: `df.groupby('category').sum()` sums up data grouped by 'category'.

4. **`.merge()`**
   - **Usage**: Join two DataFrames based on a common key.
   - **Example**: `pd.merge(df1, df2, on='id', how='inner')` performs an inner join on 'id'.

5. **`.pivot_table()`**
   - **Usage**: Create a pivot table for summarizing data.
   - **Example**: `df.pivot_table(values='sales', index='month', aggfunc='mean')` calculates average sales per month.

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In Pandas, both Series and DataFrame are mutable in nature.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [1]:
import pandas as pd

names = pd.Series(['Alice', 'Bob', 'Charlie'])
scores = pd.Series([85, 90, 88])

In [2]:
data = pd.DataFrame({'Name':names,'Score':scores})

In [3]:
data

      Name  Score
0    Alice     85
1      Bob     90
2  Charlie     88